In [1]:
# Import dependencies
import pandas as pd
import os
from sqlalchemy import create_engine

In [2]:
# Bring in CSVs
wwii_data = 'Resources/THOR_WWII_DATA_CLEAN.csv'
weather_stations = 'Resources/weather_stations.csv'

In [7]:
#read in first csv to dataframe
wwii_df = pd.read_csv(weather_stations,encoding='latin-1', low_memory=False)
wwii_df.head()

   Unnamed: 0   WBAN            NAME STATE/COUNTRY ID   Latitude  Longitude
0           0  33013          AIN EL               AL  36.383333   6.650000
1           1  33031        LA SENIA               AL  35.616667   0.583333
2           2  33023  MAISON BLANCHE               AL  36.716667   3.216667
3           3  33044        TELERGMA               AL  36.116667   6.416667
4           4  12001         TINDOUF               AL  27.683333  -8.083333

In [8]:
#get columns
wwii_df.columns

Index(['Unnamed: 0', 'WBAN', 'NAME', 'STATE/COUNTRY ID', 'Latitude',
       'Longitude'],
      dtype='object')

In [9]:
#new df with only columns
##wwii_clean = wwii_df[['COUNTRY_FLYING_MISSION', 'TGT_COUNTRY', 'TGT_LOCATION', 'LATITUDE', 'LONGITUDE']].copy()
##wwii_clean.head()

In [10]:
#read in weather station data
##stations_df = pd.read_csv(weather_stations,encoding='latin-1', low_memory=False)
##stations_df.head()

In [11]:
##stations_clean = stations_df[['WBAN', 'NAME', 'STATE/COUNTRY ID', 'Latitude', 'Longitude']].copy()
##stations_clean.head()

In [12]:
# read in weather data
##weather_df = pd.read_csv(weather_stations,encoding='latin-1', low_memory=False)
##weather_df.head()

In [9]:
#get column names
##weather_df.columns

Index(['Unnamed: 0', 'WBAN', 'NAME', 'STATE/COUNTRY ID', 'Latitude',
       'Longitude'],
      dtype='object')

In [20]:
weather_stations = wwii_df.drop(columns = ['Unnamed: 0'])
weather_stations

      WBAN            NAME STATE/COUNTRY ID   Latitude  Longitude
0    33013          AIN EL               AL  36.383333   6.650000
1    33031        LA SENIA               AL  35.616667   0.583333
2    33023  MAISON BLANCHE               AL  36.716667   3.216667
3    33044        TELERGMA               AL  36.116667   6.416667
4    12001         TINDOUF               AL  27.683333  -8.083333
..     ...             ...              ...        ...        ...
156  33109       EL AQUINA               TS  36.850000  10.016667
157  33121         EL DJEM               TS  35.333333  10.066667
158  33003      SISI AHMED               TS  37.200000   9.083333
159  33307           ADANA               TU  36.983333  35.016667
160  15027      WARRINGTON               UK  53.383333  -2.050000

[161 rows x 5 columns]

In [23]:
stations_clean = weather_stations.rename(columns={"STATE/COUNTRY ID": "State_Country"})
stations_clean

      WBAN            NAME State_Country   Latitude  Longitude
0    33013          AIN EL            AL  36.383333   6.650000
1    33031        LA SENIA            AL  35.616667   0.583333
2    33023  MAISON BLANCHE            AL  36.716667   3.216667
3    33044        TELERGMA            AL  36.116667   6.416667
4    12001         TINDOUF            AL  27.683333  -8.083333
..     ...             ...           ...        ...        ...
156  33109       EL AQUINA            TS  36.850000  10.016667
157  33121         EL DJEM            TS  35.333333  10.066667
158  33003      SISI AHMED            TS  37.200000   9.083333
159  33307           ADANA            TU  36.983333  35.016667
160  15027      WARRINGTON            UK  53.383333  -2.050000

[161 rows x 5 columns]

In [24]:
stations_clean.to_csv('Resources/weather_stations.csv')

In [26]:
import sqlite3
from sqlite3 import Error

import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, inspect

# Import Flask 
# from flask import Flask, jsonify

# Setup Database
engine = create_engine('sqlite:///wwii.db', echo=False)

stations_clean.to_sql(name='weather_stations', con=engine, if_exists='append', index=False)